 import Box from "@mui/material/Box";

function PrivacyPolicy() {
  return (
    <Box sx={{ height: 2050, width: "100%", background: "white" }}>
      <h4 style={{ textAlign: "center" }}>
        ПОЛИТИКА ПО ОБРАБОТКЕ ПЕРСОНАЛЬНЫХ ДАННЫХ
      </h4>
      <h3 style={{ textAlign: "center" }}>1. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
      <div style={{ marginLeft: "20px" }}>
        1.1. Настоящая Политика в отношении обработки персональных данных (далее
        – «Политика») определяет политику «Jumunona e-Commerce Co., Ltd.» (далее
        – «Общество») в отношении обработки и обеспечения безопасности
        персональных данных.<br></br>
        1.2. Политика разработана в соответствии с законодательством Республики
        Таджикистана в области персональных данных.<br></br>
        1.3. Целью настоящей политики является установление основных принципов и
        подходов к обработке и обеспечению защиты персональных данных в
        Обществе, являющемся оператором персональных данных.<br></br>
        1.4. Действие Политики распространяется на все процессы Общества,
        связанные с обработкой персональных данных.<br></br>
        1.5. Пересмотр настоящей Политики может осуществляться по усмотрению
        Общества на плановой и внеплановой основе, а также в случаях изменения
        законодательств Республики Таджикистана в области персональных данных.
        <br></br>
        1.6. Актуальная редакция Политики размещается на приложении Общества в
        информационно-телекоммуникационной сети Интернет в общем доступе и
        вступает в силу с момента размещения.<br></br>
      </div>
      <h4 style={{ textAlign: "center" }}>
        2. ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
      </h4>
      <div style={{ marginLeft: "20px" }}>
        2.1. Обработка персональных данных в Обществе осуществляется на законной
        и справедливой основе.<br></br>
        2.2. Обработка персональных данных ограничивается достижением
        конкретных, заранее определенных и законных целей. Не допускается
        обработка персональных данных, несовместимая с целями сбора персональных
        данных.<br></br>
        2.3. Не допускается объединение баз данных, содержащих персональные
        данные, обработка которых осуществляется в целях, несовместимых между
        собой.
        <br></br>
        2.4. При обработке персональных данных обеспечены точность,
        достаточность и актуальность персональных данных по отношению к целям
        обработки, обеспечены меры по удалению или уточнению неполных или
        неточных данных.<br></br>
        2.5. Хранение персональных данных осуществляется в форме, позволяющей
        определить субъекта персональных данных, не дольше, чем этого требуют
        цели обработки персональных данных, если иной срок не установлен
        действующим законодательством или договором с субъектом персональных
        данных. Обрабатываемые персональные данные подлежат уничтожению либо
        обезличиванию по достижении целей обработки или в случае утраты
        необходимости в достижении этих целей, если иное не предусмотрено
        действующим законодательством.<br></br>
        2.6. При обработке персональных данных Общество обеспечивает их
        безопасность и конфиденциальность, не раскрывает и не распространяет
        третьим лицам персональные данные без согласия субъекта персональных
        данных, если иное не предусмотрено действующим законодательством.
        <br></br>
        <h4 style={{ textAlign: "center" }}>
          3. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </h4>
        3.1. Обработка персональных данных в информационных системах Общества
        осуществляется в целях, определенных регламентами и правилами
        информационных систем, а также осуществления уставной деятельности
        Общества и действующим законодательством.
        <br></br>
        3.2. Обработка персональных данных осуществляется с целью заключения и
        исполнения договоров сторонами, выгодоприобретателями или поручителями
        которых являются субъекты персональных данных.
        <br></br>
        <div style={{ marginLeft: "15px" }}>
          2.2.1. Идентификация стороны в рамках Сервиса, соглашений и договоров
          с Общество;<br></br>
          2.2.2.Предоставление Пользователю персонализированных Сервисов и
          исполнение соглашений и договоров;<br></br>
          2.2.3.Связь с Пользователем, в том числе направление уведомлений,
          запросов и информации, касающихся использования Сервисов, исполнения
          соглашений и договоров, а также обработка запросов и заявок от
          Пользователя;<br></br>
          2.2.4.Улучшение качества Сервиса, удобства их использования,
          разработка новых Сервисов;<br></br>
          2.2.5.Проведение статистических и иных исследований на основе
          обезличенных данных.
        </div>
        <h4 style={{ textAlign: "center" }}>
          4. ПРАВИЛА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </h4>
        <div>
          4.1. Обработка персональных данных в Обществе осуществляется с
          согласия субъекта персональных данных кроме случаев, установленных
          действующим законодательством.<br></br>
          4.2. Общество не собирает и не обрабатывает биометрические
          персональные данные, а также персональные данные специальных
          категорий, касающиеся расовой, национальной принадлежности,
          политических взглядов, религиозных или философских убеждений,
          состояния здоровья, интимной жизни.
          <br></br>
          4.3. Общество не размещает персональные данные в общедоступных
          источниках без предварительного согласия субъекта персональных данных,
          если иное не определено действующим законодательством.<br></br>
          4.4. Обработка персональных данных в Обществе может осуществляться как
          с применением, так и без применения средств автоматизации.<br></br>
          4.5. Работники Общества имеют доступ к персональным данным субъектов в
          соответствии с их должностными обязанностями.<br></br>
          4.6. Передача персональных данных субъектов третьим лицам
          осуществляется в соответствии с требованиями действующего
          законодательства.<br></br>
          4.7. Общество вправе поручить обработку персональных данных третьей
          стороне с согласия субъекта персональных данных и в иных случаях,
          предусмотренных действующим законодательством, на основании
          заключаемого с этой стороной договора. Третья сторона, осуществляющая
          обработку персональных данных по поручению Общества, обязана выполнять
          требования по обеспечению уровня защищенности персональных данных,
          установленные действующим законодательством.<br></br>
        </div>
        
        <h4 style={{ textAlign: "center" }}>
          5. РЕАЛИЗУЕМЫЕ ТРЕБОВАНИЯ ПО ОБЕСПЕЧЕНИЮ БЕЗОПАСНОСТИ ПЕРСОНАЛЬНЫХ
          ДАННЫХ
        </h4>
        <div>
          5.1. Безопасность персональных данных, обрабатываемых в Обществе,
          обеспечивается выполнением согласованных мероприятий, направленных на
          предотвращение, устранение угроз безопасности персональных данных и
          минимизацию возможного ущерба, а также мероприятий по восстановлению
          данных и работы информационных систем в случае реализации угроз.
          <br></br>
          5.2. Общество принимает необходимые и достаточные правовые,
          организационные и технические меры или обеспечивает их принятие для
          защиты персональных данных от неправомерного или случайного доступа,
          уничтожения, изменения, блокирования, копирования, предоставления,
          распространения персональных данных, а также от иных неправомерных
          действий в отношении персональных данных.<br></br>
        </div>
        <h4 style={{ textAlign: "center" }}>
          6. ПРАВА СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </h4>
        <div>
          6.1. Субъект персональных данных имеет все права на получение
          информации, касающейся обработки его персональных данных,
          установленные действующим законодательством.<br></br>
          6.2. Субъект персональных данных вправе требовать уточнения его
          персональных данных, их блокирования или уничтожения в случае, если
          персональные данные являются неполными, устаревшими, неточными,
          незаконно полученными или не являются необходимыми для заявленной цели
          обработки, а также принимать предусмотренные действующим
          законодательством меры по защите своих прав.
        </div>
      </div>
    </Box>
  );
}

export default PrivacyPolicy;
